#**************************************************************
# This .sdc file is created by Terasic Tool.
# Users are recommended to modify this file to match users logic.
#**************************************************************

#**************************************************************
# Create Clock
#**************************************************************
create_clock -add -name sys_clk_pin -period 20 -waveform {0 10} [get_ports CLOCK_50]
create_clock -add -name sys_clk_pin -period 20 -waveform {0 10} [get_ports CLOCK2_50]
create_clock -add -name sys_clk_pin -period 20 -waveform {0 10} [get_ports CLOCK3_50]


#**************************************************************
# Create Generated Clock
#**************************************************************
derive_pll_clocks



#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************
derive_clock_uncertainty



#**************************************************************
# Set Input Delay
#**************************************************************
# set_input_delay -clock sys_clk_pin -max 4 [all_inputs]
# set_input_delay -clock sys_clk_pin -min 2 [all_inputs]


#**************************************************************
# Set Output Delay
#**************************************************************
# set_output_delay -clock sys_clk_pin -max 8 [all_outputs]
# set_output_delay -clock sys_clk_pin -min -3 [all_outputs]


#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************
set_false_path -from * -to [get_ports { all_outputs }]


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Load
#**************************************************************



